[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [Shenanigans / DUPLICATED-FrontEnd Servers EC2-29408 ](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/3dbebbc0-d8df-4968-9025-6d70b1cc4388):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:


  # module.acme-ec2.aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-0bf3fc7dfe888c036"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = false
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3a.small"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = false
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = "subnet-0239c0713c64a677f"
+       tags                                 = {
+           "Demo"      = "April 1"
+           "Name"      = "acme-frontend"
+           "Owner"     = "acme demo org"
+           "Terraform" = "true"
+           "Test"      = "new tag"
        }
+       tags_all                             = {
+           "Demo"      = "April 1"
+           "Name"      = "acme-frontend"
+           "Owner"     = "acme demo org"
+           "Terraform" = "true"
+           "Test"      = "new tag"
        }
+       tenancy                              = "default"
+       volume_tags                          = {
+           "Name" = "acme-frontend"
        }
+       vpc_security_group_ids               = (known after apply)

+       credit_specification {
+           cpu_credits = "standard"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   instances  = [
+       (known after apply),
    ]
+   private_ip = [
+       (known after apply),
    ]
+   public_ip  = [
+       (known after apply),
    ]
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/3dbebbc0-d8df-4968-9025-6d70b1cc4388/deployments/8f874a06-914f-46a1-879d-c1b06f17685d)
